In [1]:
#consistes of series
#group of series form dataframe

import pandas as pd
s1 = pd.Series(data=[1,2,3,4,5],index=['a','b','c','d','e'])

In [2]:
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
s2 = pd.Series(data=[11,22,33,44,55],index=['a','b','c','d','e'])

In [4]:
s2

a    11
b    22
c    33
d    44
e    55
dtype: int64

In [5]:
s1+s2

a    12
b    24
c    36
d    48
e    60
dtype: int64

In [7]:
s1['a']

1

In [8]:
s1['a':'d']

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
s1[0:3]

a    1
b    2
c    3
dtype: int64

In [10]:
pd.DataFrame({'A':s1,'B':s2})

   A   B
a  1  11
b  2  22
c  3  33
d  4  44
e  5  55

In [11]:
pd.DataFrame({'A':s1,'B':s2}, index=['a','b','g'])

     A     B
a  1.0  11.0
b  2.0  22.0
g  NaN   NaN

In [13]:
pd.DataFrame([s1,s2])

    a   b   c   d   e
0   1   2   3   4   5
1  11  22  33  44  55

In [14]:
s3 = pd.Series(data=[111,222],index=['a','b'])

In [15]:
s3

a    111
b    222
dtype: int64

In [16]:
df = pd.DataFrame({'A':s1,'B':s2, 'C':s3})

In [17]:
df

   A   B      C
a  1  11  111.0
b  2  22  222.0
c  3  33    NaN
d  4  44    NaN
e  5  55    NaN

In [24]:
tent_data = pd.read_csv('data\house_rental_data.csv')

In [25]:
tent_data.describe()

,Unnamed: 0,Sqft,Floor,TotalFloor,Bedroom,Living.Room,Bathroom,Price
count,645.000000,645.000000,645.000000,645.000000,645.000000,645.000000,645.000000,645.000000
mean,325.159690,1527.656260,5.939535,10.855814,2.837209,1.813953,1.810853,61986.823256
std,187.312152,767.386531,3.884721,4.996208,1.010740,0.462364,0.683574,35635.091007
min,1.000000,359.358000,1.000000,1.000000,1.000000,0.000000,0.000000,6100.000000
25%,164.000000,925.080000,3.000000,7.000000,2.000000,2.000000,1.000000,39000.000000
50%,326.000000,1423.200000,5.000000,12.000000,3.000000,2.000000,2.000000,50000.000000
75%,487.000000,1892.856000,8.000000,14.000000,4.000000,2.000000,2.000000,75000.000000
max,648.000000,5856.468000,22.000000,38.000000,7.000000,4.000000,5.000000,250000.000000

In [26]:
tent_data.head()

,Unnamed: 0,Sqft,Floor,TotalFloor,Bedroom,Living.Room,Bathroom,Price
0,1,1177.698,2,7,2,2,2,62000
1,2,2134.800,5,7,4,2,2,78000
2,3,1138.560,5,7,2,2,1,58000
3,4,1458.780,2,7,3,2,2,45000
4,5,967.776,11,14,3,2,2,45000

In [28]:
emp_data = pd.read_csv('data\HR_comma_sep.csv')

In [32]:
emp_data.head()
#descriptive statistics

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [31]:
emp_data.describe()
#inferential staistics

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years
count,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000
mean,0.612834,0.716102,3.803054,201.050337,3.498233,0.144610,0.238083,0.021268
std,0.248631,0.171169,1.232592,49.943099,1.460136,0.351719,0.425924,0.144281
min,0.090000,0.360000,2.000000,96.000000,2.000000,0.000000,0.000000,0.000000
25%,0.440000,0.560000,3.000000,156.000000,3.000000,0.000000,0.000000,0.000000
50%,0.640000,0.720000,4.000000,200.000000,3.000000,0.000000,0.000000,0.000000
75%,0.820000,0.870000,5.000000,245.000000,4.000000,0.000000,0.000000,0.000000
max,1.000000,1.000000,7.000000,310.000000,10.000000,1.000000,1.000000,1.000000

In [33]:
emp_data.rename(columns={'sales':'dept'},inplace=True)

In [35]:
emp_data.describe()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years
count,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000
mean,0.612834,0.716102,3.803054,201.050337,3.498233,0.144610,0.238083,0.021268
std,0.248631,0.171169,1.232592,49.943099,1.460136,0.351719,0.425924,0.144281
min,0.090000,0.360000,2.000000,96.000000,2.000000,0.000000,0.000000,0.000000
25%,0.440000,0.560000,3.000000,156.000000,3.000000,0.000000,0.000000,0.000000
50%,0.640000,0.720000,4.000000,200.000000,3.000000,0.000000,0.000000,0.000000
75%,0.820000,0.870000,5.000000,245.000000,4.000000,0.000000,0.000000,0.000000
max,1.000000,1.000000,7.000000,310.000000,10.000000,1.000000,1.000000,1.000000

emp_data.head()

In [41]:
emp_data.dept.value_counts()
#nominal data

sales          4140
technical      2720
support        2229
IT             1227
product_mng     902
marketing       858
RandD           787
accounting      767
hr              739
management      630
Name: dept, dtype: int64

In [42]:
emp_data.salary.value_counts()
#ordinal data => values have a relation

low       7316
medium    6446
high      1237
Name: salary, dtype: int64

In [43]:
emp_data.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,dept,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [44]:
#first check if data is balanced is not
#question. to predict if a person will leave or not
#because we have a column/variable left=0/1

emp_data.left.plot()

In [50]:
emp_data.left.mean()

0.2380825388359224

In [51]:
#target variable/response variable/dependent variable => left
#All other variables => Feature vector/ Independent variable

#Usually dataset is represented as (vector(X), Y)
#Vector(X) => Feature vector

In [52]:
#need to heck if there are any lurking variables , which is not considered in X, or Y

In [53]:
#mean is impacted by outliers

#mean = sum/count
#median => Sort value, take middle
#mode => Max occuring value